import React from 'react'

const page = () => {
  return (
    <>
      <div className="flex justify-center items-center min-h-screen py-6 bg-zinc-200">
        <div className='bg-zinc-100 py-10 px-60 shadow-lg'>
          <article className="prose lg:prose-lg">
            <h2 className='text-center'>游戏介绍</h2>
            <p>《校园忆：心之引》是一幅诗意绘就的解谜冒险之旅，在校园宿舍的迷离光影中，描绘了成长、热爱和爱情的壮美篇章。 </p>
            <hr/>
            <h3>基本属性</h3>
            <h4>外观</h4>
            <ul><li>2D横版</li></ul>
            <h4>主题</h4>
            <ul><li>校园、解谜、穿越</li></ul>
            <h4>类别</h4>
            <ul><li>校园主题解谜游戏</li></ul>
            <h4>关键字</h4>
            <ul><li>志向，爱情</li></ul>
            <h3>背景人设</h3>
            <ul><li>低落烦躁的华科大三生</li><li>距组原课设ddl只有9H</li><li>曾经热爱地理</li><li>高中有女朋友现已分手</li></ul>
            <h3>内容简述</h3>
            <p>《校园忆：心之引》是一幅诗意绘就的解谜冒险之旅，在校园宿舍的迷离光影中，描绘了成长、热爱和爱情的壮美篇章。  </p>
            <p> 踏入游戏的门槛，你将穿越时光的窗户，跨越心灵的纬度。在琐碎的学业压力下，男主角如疲倦的骏马，忘却了内心的追逐和热望。然而，当他迷恋计算机的冰冷逻辑时，突然闪现的灵光引领他踏上另一片领域，一个神秘而美丽的里世界。  </p>
            <p>在热爱的线索中，男主角怀抱着曾经熊熊燃烧的地理之情，轻轻触碰着灰暗的火山岩。那一块看似普通的石头，仿佛是岁月的铭刻，流转着神奇的温度。而在被衣物掩盖的地球仪下，蕴藏着无尽的回忆。它曾陪伴着男主角度过他的童年岁月，指引他脚下那滚圆的星球，是初恋的模样，梦想的起点。    </p>
            <p>在宿舍中，男主角追寻着遗失的碎片，寻觅着逝去的激情。一串钥匙，似乎记载着珍贵的珍禽稀兽；一段旅行日期，承载着流浪的脚步。在柜子的深处，他发现了一张冰箱贴，它展现着世界的脉络，河流的流动，人与人的联系。它们如音符般排列，谱写出男主角内心的交响乐。   </p>
            <p> 然而，爱情的记忆仍如燃烧的篝火，温暖而不可触及。一封生日祝福信悄然夹在书架的角落，记录着青春的往事，以及分离的决绝。逝去的岁月在一块拼图中重现，那是他们共度的一周年纪念日。拼合每一片碎片，男主角感受着过去的重量，曾经的温柔在指尖流转。</p>
          </article>
        </div>
      </div>
    </>
  )
}

export default page